
;*********************************************************************************************************************************
;  alg_3 - ;  определение кода кнопки числа с мини-клавиатуры
;*********************************************************************************************************************************
	 

alg_3:  


; передача 0 в порт на нужную горизонталь

	MOV A, KOD_ST_4
	setb ren

	CJNE A, #00b, alg_3_01 ;   если горизонталь 0 то в P1.4 0
	MOV P1, #11101111b
	JMP alg_3_XX
	
alg_3_01:
	CJNE A, #01b, alg_3_10 ;    если горизонталь 1 то в P1.5 0
	MOV P1, #11011111b
	JMP alg_3_XX

alg_3_10:
	CJNE A, #10b, alg_3_11 ;    если горизонталь 2 то в P1.6 0
	MOV P1, #10111111b
	JMP alg_3_XX
	
alg_3_11:
	CJNE A, #11b, alg_3_XX ;    если горизонталь 3 то в P1.7 0
	MOV P1, #01111111b
	
alg_3_XX:	
	
 	JB P1.0, j_3		; здесь € делаю проверку на все 0, ибо тогда можно сразу уйти в конец алгоритма
	JMP alg_3_3_0		;..............................................................................
j_3:
	JB P1.1, j_31		;....................................................................
	JMP alg_3_3_0		;..........................................................
j_31:
	JB P1.2, j_32		;................................................
	JMP alg_3_3_0		;......................................
j_32:
	CLR BITC		;................................................
	JMP alg_3_3_XX		;..........................................................
	
alg_3_3_0:

	JB P1.0, alg_3_3_1     	;  если P1.0 0 то выстави 
	MOV KOD_KL, #00000000b 	;  запись в 2,3 разр€ды 00
	MOV A, KOD_KL		; сложение с KOD_ST_4
	ADD A, KOD_ST_4   
	MOV KOD_KL, A   
	SETB BITC               ; устанавливаем Ѕит —
	JMP alg_3_3_XX
	
alg_3_3_1:

	JB P1.1, alg_3_3_2      ;  если P1.1 0 то выстави 
	MOV KOD_KL, #00000100b  ;  запись в 2,3 разр€ды 01
	MOV A, KOD_KL		; сложение с KOD_ST_4
	ADD A, KOD_ST_4   
	MOV KOD_KL, A
	SETB BITC               ; устанавливаем Ѕит —
	JMP alg_3_3_XX
	
alg_3_3_2:

	JB P1.2, alg_3_3_XX     ; если P1.2 0 то выстави 
	MOV KOD_KL, #00001000b  ; запись в 2,3 разр€ды 10
	MOV A, KOD_KL		; сложение с KOD_ST_4
	ADD A, KOD_ST_4   
	MOV KOD_KL, A
	SETB BITC               ; устанавливаем Ѕит —
	JMP alg_3_3_XX
	
	
alg_3_3_XX:
 	
ret